redisTestResult/redisMutiThreadsTestResultFix/redis_test_result_by_memtier_benchmark_F_OFF_2nd/redis_result_Sequential110_F_OFF_P2_2nd_20230719221101.log
20        Threads
5         Connections per thread
40        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        37587.97          ---          ---         2.41691         2.30300         4.67100         5.34300     41295.38 
Gets         3757.69      3757.69         0.00         2.40472         2.30300         4.67100         5.27900      4109.97 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      41345.66      3757.69         0.00         2.41580         2.30300         4.67100         5.31100     45405.35 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.103        0.000
SET       2.127        5.000
SET       2.175       10.000
SET       2.207       15.000
SET       2.223       20.000
SET       2.239       25.000
SET       2.255       30.000
SET       2.271       35.000
SET       2.287       40.000
SET       2.287       45.000
SET       2.303       50.000
SET       2.319       52.500
SET       2.319       55.000
SET       2.335       57.500
SET       2.335       60.000
SET       2.351       62.500
SET       2.351       65.000
SET       2.367       67.500
SET       2.383       70.000
SET       2.399       72.500
SET       2.415       75.000
SET       2.415       76.250
SET       2.431       77.500
SET       2.447       78.750
SET       2.447       80.000
SET       2.463       81.250
SET       2.479       82.500
SET       2.511       83.750
SET       2.527       85.000
SET       2.543       86.250
SET       2.559       87.500
SET       2.575       88.125
SET       2.591       88.750
SET       2.591       89.375
SET       2.607       90.000
SET       2.623       90.625
SET       2.623       91.250
SET       2.639       91.875
SET       2.655       92.500
SET       2.671       93.125
SET       2.687       93.750
SET       2.687       94.062
SET       2.703       94.375
SET       2.719       94.688
SET       2.735       95.000
SET       2.783       95.312
SET       2.895       95.625
SET       3.055       95.938
SET       3.151       96.250
SET       3.231       96.562
SET       3.391       96.875
SET       3.855       97.031
SET       4.255       97.188
SET       4.351       97.344
SET       4.383       97.500
SET       4.447       97.656
SET       4.479       97.812
SET       4.511       97.969
SET       4.511       98.125
SET       4.543       98.281
SET       4.575       98.438
SET       4.575       98.516
SET       4.607       98.594
SET       4.607       98.672
SET       4.639       98.750
SET       4.639       98.828
SET       4.671       98.906
SET       4.671       98.984
SET       4.703       99.062
SET       4.703       99.141
SET       4.735       99.219
SET       4.767       99.258
SET       4.767       99.297
SET       4.799       99.336
SET       4.831       99.375
SET       4.831       99.414
SET       4.863       99.453
SET       4.895       99.492
SET       4.927       99.531
SET       4.959       99.570
SET       5.023       99.609
SET       5.023       99.629
SET       5.055       99.648
SET       5.087       99.668
SET       5.119       99.688
SET       5.119       99.707
SET       5.151       99.727
SET       5.183       99.746
SET       5.183       99.766
SET       5.215       99.785
SET       5.215       99.805
SET       5.247       99.814
SET       5.247       99.824
SET       5.247       99.834
SET       5.279       99.844
SET       5.279       99.854
SET       5.279       99.863
SET       5.311       99.873
SET       5.311       99.883
SET       5.311       99.893
SET       5.343       99.902
SET       5.343       99.907
SET       5.343       99.912
SET       5.343       99.917
SET       5.375       99.922
SET       5.375       99.927
SET       5.375       99.932
SET       5.407       99.937
SET       5.407       99.941
SET       5.439       99.946
SET       5.471       99.951
SET       5.471       99.954
SET       5.471       99.956
SET       5.503       99.958
SET       5.535       99.961
SET       5.567       99.963
SET       5.663       99.966
SET       5.727       99.968
SET       5.823       99.971
SET       5.951       99.973
SET       6.079       99.976
SET       6.143       99.977
SET       6.239       99.978
SET       6.303       99.979
SET       6.335       99.980
SET       6.399       99.982
SET       6.495       99.983
SET       6.623       99.984
SET       6.719       99.985
SET       6.847       99.987
SET       6.975       99.988
SET       7.103       99.988
SET       7.231       99.989
SET       7.551       99.990
SET       8.383       99.990
SET       9.023       99.991
SET       9.087       99.991
SET      10.239       99.992
SET      14.719       99.993
SET      17.151       99.993
SET     339.967       99.994
SET     339.967       99.994
SET     339.967       99.995
SET     339.967       99.995
SET     339.967       99.995
[...]
SET     339.967       99.996
SET     342.015       99.996
SET     342.015       99.996
SET     342.015       99.997
SET     342.015       99.997
SET     342.015       99.997
[...]
SET     342.015       99.998
SET     342.015       99.998
SET     342.015       99.998
[...]
SET     344.063       99.998
SET     344.063       99.998
SET     344.063       99.999
SET     344.063       99.999
SET     344.063       99.999
[...]
SET     344.063      100.000
SET     344.063      100.000
SET     344.063      100.000
[...]
SET     346.111      100.000
SET     346.111      100.000
---
GET       0.127        0.000
GET       2.127        5.000
GET       2.175       10.000
GET       2.207       15.000
GET       2.223       20.000
GET       2.239       25.000
GET       2.255       30.000
GET       2.271       35.000
GET       2.287       40.000
GET       2.287       45.000
GET       2.303       50.000
GET       2.319       52.500
GET       2.319       55.000
GET       2.335       57.500
GET       2.335       60.000
GET       2.351       62.500
GET       2.351       65.000
GET       2.367       67.500
GET       2.383       70.000
GET       2.399       72.500
GET       2.415       75.000
GET       2.415       76.250
GET       2.431       77.500
GET       2.447       78.750
GET       2.447       80.000
GET       2.463       81.250
GET       2.479       82.500
GET       2.495       83.750
GET       2.527       85.000
GET       2.543       86.250
GET       2.559       87.500
GET       2.575       88.125
GET       2.591       88.750
GET       2.591       89.375
GET       2.607       90.000
GET       2.623       90.625
GET       2.623       91.250
GET       2.639       91.875
GET       2.655       92.500
GET       2.671       93.125
GET       2.687       93.750
GET       2.687       94.062
GET       2.703       94.375
GET       2.703       94.688
GET       2.735       95.000
GET       2.751       95.312
GET       2.815       95.625
GET       2.991       95.938
GET       3.119       96.250
GET       3.215       96.562
GET       3.327       96.875
GET       3.503       97.031
GET       4.079       97.188
GET       4.287       97.344
GET       4.351       97.500
GET       4.415       97.656
GET       4.447       97.812
GET       4.479       97.969
GET       4.511       98.125
GET       4.543       98.281
GET       4.575       98.438
GET       4.575       98.516
GET       4.575       98.594
GET       4.607       98.672
GET       4.607       98.750
GET       4.639       98.828
GET       4.639       98.906
GET       4.671       98.984
GET       4.671       99.062
GET       4.703       99.141
GET       4.703       99.219
GET       4.735       99.258
GET       4.735       99.297
GET       4.767       99.336
GET       4.799       99.375
GET       4.799       99.414
GET       4.831       99.453
GET       4.863       99.492
GET       4.895       99.531
GET       4.927       99.570
GET       4.959       99.609
GET       4.991       99.629
GET       5.023       99.648
GET       5.023       99.668
GET       5.055       99.688
GET       5.087       99.707
GET       5.119       99.727
GET       5.119       99.746
GET       5.151       99.766
GET       5.183       99.785
GET       5.183       99.805
GET       5.183       99.814
GET       5.215       99.824
GET       5.215       99.834
GET       5.215       99.844
GET       5.247       99.854
GET       5.247       99.863
GET       5.247       99.873
GET       5.247       99.883
GET       5.279       99.893
GET       5.279       99.902
GET       5.279       99.907
GET       5.311       99.912
GET       5.311       99.917
GET       5.311       99.922
GET       5.343       99.927
GET       5.343       99.932
GET       5.343       99.937
GET       5.375       99.941
GET       5.375       99.946
GET       5.407       99.951
GET       5.407       99.954
GET       5.407       99.956
GET       5.407       99.958
GET       5.407       99.961
GET       5.439       99.963
GET       5.439       99.966
GET       5.439       99.968
GET       5.471       99.971
GET       5.471       99.973
GET       5.535       99.976
GET       5.567       99.977
GET       5.599       99.978
GET       5.663       99.979
GET       5.823       99.980
GET       6.015       99.982
GET       6.143       99.983
GET       6.271       99.984
GET       6.271       99.985
GET       6.335       99.987
GET       6.335       99.988
GET       6.495       99.988
GET       6.559       99.989
GET       6.687       99.990
GET       7.295       99.990
GET       7.327       99.991
GET       8.255       99.991
GET       8.511       99.992
GET       8.511       99.993
GET       8.703       99.993
GET       9.791       99.994
GET      12.031       99.994
GET      12.031       99.995
GET      14.719       99.995
GET      14.719       99.995
GET      17.279       99.995
GET      17.279       99.996
GET      17.663       99.996
GET      17.663       99.996
GET      17.663       99.997
GET     339.967       99.997
GET     339.967       99.997
GET     339.967       99.997
[...]
GET     339.967       99.998
GET     339.967       99.998
GET     339.967       99.998
[...]
GET     339.967       99.999
GET     339.967       99.999
GET     339.967       99.999
[...]
GET     342.015       99.999
GET     342.015      100.000
---
WAIT      0.000      100.000